Public Member Functions | Protected Member Functions | Friends | List of all members
ACAPI::MEP::v1::PipingPortDefault Class Referencefinal
MEP Element Manager
Through this PipingPortDefault you can access and configure the PipingPorts of MEPElementDefaults before placement. More...
#include <MEPPipingPortDefault.hpp>
 Inheritance diagram for ACAPI::MEP::v1::PipingPortDefault:
 Public Member Functions
double  | GetDiameter () const
double  | GetWallThickness () const
FlowDirection  | GetFlowDirection () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
void  | SetDiameter (double diameter)
Sets the diameter of the PipingPort.
void  | SetWallThickness (double thickness)
Sets the thickness of the PipingPort's wall.
void  | SetFlowDirection (FlowDirection flowDirection)
Sets the flow direction of the PipingPort.
 Public Member Functions inherited from ACAPI::MEP::v1::PortDefaultBase
GS::UniString  | GetName () const
double  | GetWidth () const
ConnectorShape  | GetShape () const
API_AttributeIndex  | GetMEPSystem () const
Domain  | GetDomain () const
template<class ModifierFunc >
Result< void >  | Modify (ModifierFunc &&modifierFunc)
Executes the given modifier scope in a NotUndoable command.
void  | SetWidth (double width)
Sets the width of the port.
void  | SetShape (ConnectorShape shape)
Sets the shape of the port.
void  | SetMEPSystem (const API_AttributeIndex &attributeIndex)
Sets the MEPSystem attribute of a Port.
 Public Member Functions inherited from ACAPI::v1::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
Modifier (PipingPortDefault &parent)
Constructs a Modifier with the given PipingPortDefault parent.
 Protected Member Functions inherited from ACAPI::MEP::v1::PortDefaultBase
PortDefaultBase (std::shared_ptr< Impl::IPortDefaultBaseImpl > impl)
Constructs a PortBase with the given PortDefaultBase implementation.
Modifier (PortDefaultBase &parent)
Constructs a Modifier with the given PortDefaultBase parent.
 Protected Member Functions inherited from ACAPI::v1::Object
~Object ()
Default destructor.
 Friends
 class  | ACAPI::Impl::ObjectCreator
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::v1::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
Through this PipingPortDefault you can access and configure the PipingPorts of MEPElementDefaults before placement.
Since
Archicad 28
Example code snippet from Test / New MEP
Take a look at PortDefaultBase
Member Function Documentation
◆ GetDiameter()
 double ACAPI::MEP::v1::PipingPortDefault::GetDiameter  |  ( |   | ) |   const
Returns
Returns the diameter of the PipingPort.
◆ GetFlowDirection()
 FlowDirection ACAPI::MEP::v1::PipingPortDefault::GetFlowDirection  |  ( |   | ) |   const
Returns
Returns the flow direction of the PipingPort.
◆ GetWallThickness()
 double ACAPI::MEP::v1::PipingPortDefault::GetWallThickness  |  ( |   | ) |   const
Returns
Returns the wall thickness of the PipingPort.
◆ Modifier()
 ACAPI::MEP::v1::PipingPortDefault::Modifier  |  ( |  PipingPortDefault &  |  parent | )
protected
Constructs a Modifier with the given PipingPortDefault parent.
Parameters
parent | The parent PipingPortDefault.
◆ Modify()
 template<typename ModifierFunc >
 Result< void > ACAPI::MEP::v1::PipingPortDefault::Modify  |  ( |  ModifierFunc &&  |  modifierFunc | )
Executes the given modifier scope in a NotUndoable command.
Parameters
modifierFunc | The modifier scope (lambda, std::function or function pointer) the caller wants to execute.
Returns
Returns an error if the process of modification fails for some reason, otherwise nothing.
◆ SetDiameter()
 void ACAPI::MEP::v1::PipingPortDefault::SetDiameter  |  ( |  double  |  diameter | )
Sets the diameter of the PipingPort.
Parameters
diameter | The value to be set.
◆ SetFlowDirection()
 void ACAPI::MEP::v1::PipingPortDefault::SetFlowDirection  |  ( |  FlowDirection  |  flowDirection | )
Sets the flow direction of the PipingPort.
Parameters
flowDirection | The value to be set.
◆ SetWallThickness()
 void ACAPI::MEP::v1::PipingPortDefault::SetWallThickness  |  ( |  double  |  thickness | )
Sets the thickness of the PipingPort's wall.
Parameters
thickness | The value to be set.